ErichStyger/MetaClockClock/Firmware/tinyK22_Master_vs_code/sdk/devices/MK22F51212/drivers/fsl_ftm.h
    reg &= ~(FTM_CONF_LDFQ_MASK);
    reg |= FTM_CONF_LDFQ(loadfreq);
    base->CONF = reg;
}
#endif /* FSL_FEATURE_FTM_HAS_CONF_LDFQ_BIT */

#if (defined(FSL_FEATURE_FTM_HAS_PAIRED_DEADTIME) && FSL_FEATURE_FTM_HAS_PAIRED_DEADTIME)
/*!
 * brief Configure deadtime for specific combined channel pair.
 *
 * param base           FTM peripheral base address
 * param config         Pointer to the user configuration structure.
 * param chnlPairNumber The FTM channel pair number; options are 0, 1, 2, 3
 */
static inline void FTM_SetPairDeadTime(FTM_Type *base,
                                       const ftm_deadtime_param_t *config,
                                       ftm_chnl_t chnlPairNumber)
{
    switch (chnlPairNumber)
    {
        case kFTM_Chnl_0:
            base->PAIR0DEADTIME = FTM_PAIR0DEADTIME_DTVALEX(config->deadTimeValue >> 6U) |
                                  FTM_PAIR0DEADTIME_DTPS(config->deadTimePrescale) |
                                  FTM_PAIR0DEADTIME_DTVAL(config->deadTimeValue);
            break;
        case kFTM_Chnl_1:
            base->PAIR1DEADTIME = FTM_PAIR1DEADTIME_DTVALEX(config->deadTimeValue >> 6U) |
                                  FTM_PAIR1DEADTIME_DTPS(config->deadTimePrescale) |
                                  FTM_PAIR1DEADTIME_DTVAL(config->deadTimeValue);
            break;
        case kFTM_Chnl_2:
            base->PAIR2DEADTIME = FTM_PAIR2DEADTIME_DTVALEX(config->deadTimeValue >> 6U) |
                                  FTM_PAIR2DEADTIME_DTPS(config->deadTimePrescale) |
                                  FTM_PAIR2DEADTIME_DTVAL(config->deadTimeValue);
            break;
        case kFTM_Chnl_3:
            base->PAIR3DEADTIME = FTM_PAIR3DEADTIME_DTVALEX(config->deadTimeValue >> 6U) |
                                  FTM_PAIR3DEADTIME_DTPS(config->deadTimePrescale) |
                                  FTM_PAIR3DEADTIME_DTVAL(config->deadTimeValue);
            break;
        default:
            assert(false);
            break;
    }
}
#endif  /* FSL_FEATURE_FTM_HAS_PAIRED_DEADTIME */

#if (defined(FSL_FEATURE_FTM_HAS_DITHERING) && FSL_FEATURE_FTM_HAS_DITHERING)
/*!
 * @brief Set PWM Period Dithering. For the PWM period dithering, the register MOD_MIRROR
 *        should be used instead of the register MOD.
 *
 * @param base            FTM peripheral base address.
 * @param moduloValue     FTM counter modulo value.
 * @param fractionalValue The modulo fractional value used in the PWM period dithering.
 */
static inline void FTM_SetPeriodDithering(FTM_Type *base,
                                          uint16_t moduloValue,
                                          uint8_t fractionalValue)
{
    assert(FSL_FEATURE_FTM_INSTANCE_HAS_DITHERINGn(base) == 1);
    base->MOD_MIRROR = FTM_MOD_MIRROR_MOD(moduloValue) | FTM_MOD_MIRROR_FRACMOD(fractionalValue);
}

/*!
 * @brief Set PWM Edge Dithering. For the PWM edge dithering, the register CnV_MIRROR
 *        should be used instead of the register CnV.
 *
 * @param base            FTM peripheral base address.
 * @param chnlNumber      The channel number.
 * @param matchValue      FTM channel n match value.
 * @param fractionalValue The channel n match fractional value used in the PWM edge dithering.
 */
static inline void FTM_SetEdgeDithering(FTM_Type *base,
                                        ftm_chnl_t chnlNumber,
                                        uint16_t matchValue,
                                        uint8_t fractionalValue)
{
    assert(FSL_FEATURE_FTM_INSTANCE_HAS_DITHERINGn(base) == 1);
    base->CV_MIRROR[chnlNumber] = FTM_CV_MIRROR_VAL(matchValue) | FTM_CV_MIRROR_FRACVAL(fractionalValue);
}
#endif  /* FSL_FEATURE_FTM_HAS_DITHERING */

#if (defined(FSL_FEATURE_FTM_HAS_CONF_CHIS_BIT) && FSL_FEATURE_FTM_HAS_CONF_CHIS_BIT)
/*!
 * @brief Get value of channel n input after the double-sampling or the filtering.
 *
 * @param base       FTM peripheral base address.
 * @param chnlNumber The channel number.
 * @return Channel n input state, 0 or 1.
 */
static inline uint32_t FTM_GetChannelInputState(FTM_Type *base, ftm_chnl_t chnlNumber)
{
    return (base->CONTROLS[chnlNumber].CnSC & FTM_CnSC_CHIS_MASK) >> FTM_CnSC_CHIS_SHIFT;
}
#endif  /* FSL_FEATURE_FTM_HAS_CONF_CHIS_BIT */

#if (defined(FSL_FEATURE_FTM_HAS_CONF_CHOV_BIT) && FSL_FEATURE_FTM_HAS_CONF_CHOV_BIT)
/*!
 * @brief Get final value of the channel n output.
 *
 * @param base       FTM peripheral base address.
 * @param chnlNumber The channel number.
 * @return Channel n output value, 0 or 1.
 */
static inline uint32_t FTM_GetChannelOutputState(FTM_Type *base, ftm_chnl_t chnlNumber)
{
    return (base->CONTROLS[chnlNumber].CnSC & FTM_CnSC_CHOV_MASK) >> FTM_CnSC_CHOV_SHIFT;
}
#endif  /* FSL_FEATURE_FTM_HAS_CONF_CHOV_BIT */

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* FSL_FTM_H_*/
